# **Chapter 7: Data Cleaning and Preparation**

## **7.1 Handling Missing Data**

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### **Filtering Out Missing Data**

In [7]:
from numpy import nan as NA # NA = np.nan

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))

In [20]:
df.iloc[:4, 1] = NA

In [21]:
df.iloc[:2, 2] = NA

In [22]:
df

          0         1         2
0  0.134359       NaN       NaN
1 -0.473936       NaN       NaN
2  1.643829       NaN  1.243000
3 -0.225503       NaN -0.230246
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

In [23]:
df.dropna()

          0         1         2
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

In [24]:
df.dropna(thresh=2) #en az 2 dolu değer içeren satırlar harici kalanları düşür.

          0         1         2
2  1.643829       NaN  1.243000
3 -0.225503       NaN -0.230246
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

## **Filling In Missing Data**

In [25]:
df

          0         1         2
0  0.134359       NaN       NaN
1 -0.473936       NaN       NaN
2  1.643829       NaN  1.243000
3 -0.225503       NaN -0.230246
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

In [26]:
df.fillna(0)

          0         1         2
0  0.134359  0.000000  0.000000
1 -0.473936  0.000000  0.000000
2  1.643829  0.000000  1.243000
3 -0.225503  0.000000 -0.230246
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

In [27]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.134359  0.500000  0.000000
1 -0.473936  0.500000  0.000000
2  1.643829  0.500000  1.243000
3 -0.225503  0.500000 -0.230246
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

In [28]:
_ = df.fillna(0, inplace=True)

In [29]:
df

          0         1         2
0  0.134359  0.000000  0.000000
1 -0.473936  0.000000  0.000000
2  1.643829  0.000000  1.243000
3 -0.225503  0.000000 -0.230246
4  0.196761 -0.220100 -0.174642
5 -2.131429 -0.504236  0.173202
6  0.251794 -0.243725  1.874324

In [30]:
df = pd.DataFrame(np.random.randn(6, 3))

In [31]:
df.iloc[2:, 1] = NA

In [32]:
df.iloc[4:, 2] = NA

In [33]:
df

          0         1         2
0 -1.617283  0.697831 -0.858397
1 -0.549014 -0.351726 -0.047270
2 -0.342936       NaN -2.099636
3  0.514481       NaN -0.553868
4 -0.287777       NaN       NaN
5 -0.634168       NaN       NaN

In [34]:
df.fillna(method="ffill")

          0         1         2
0 -1.617283  0.697831 -0.858397
1 -0.549014 -0.351726 -0.047270
2 -0.342936 -0.351726 -2.099636
3  0.514481 -0.351726 -0.553868
4 -0.287777 -0.351726 -0.553868
5 -0.634168 -0.351726 -0.553868

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [36]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## **7.2 Data Transformation**

### **Removing Duplicates**

In [38]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [39]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)

In [43]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [44]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [45]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### **Transforming Data Using a Function or Mapping**